# Usage:
#   brew tap Homebrew/bundle
#   brew bundle

# Install GNU utilities (without prefixes)
# Those that come with OS X are outdated
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "coreutils"
brew "findutils" #, args: ["with-default-names"]

# Install more recent versions of some OS X tools
tap "homebrew/dupes"
# brew homebrew/dupes/rsync

# Install dependencies
brew "automake"
brew "makedepend"
brew "pkg-config"
brew "openssl"
brew "readline"

# Install Libraries other bottles may depend on
brew "icu4c"
brew "jpeg"
brew "libgcrypt"
brew "libidn"
brew "libpng"
brew "libtiff"
brew "librsvg"
brew "libssh2"
brew "libtool"
brew "libuv" # for powerline
brew "libyaml"

cask "xquartz"

# Install languages other bottles may depend on
brew "python"
brew "python3"

# Install more tools
brew "ack"
brew "bash-completion"
brew "cask-repair"
brew "ctags"
# brew "curl"
brew "fontconfig"
brew "webp"
brew "freetype"
brew "git"
brew "hub"
brew "gist"
brew "gd"
brew "gnupg"
brew "gpg-agent"
brew "graphviz"
brew "htop-osx"
brew "imagemagick"
brew "lua51"
brew "mas"
brew "mongodb"
brew "mscgen"
brew "mysql"
brew "node"
brew "casperjs"
brew "chromedriver"
brew "phantomjs"
brew "pow"
brew "pstree"
brew "reattach-to-user-namespace"
brew "ssh-copy-id"
brew "tmux"
brew "vim", args: ["with-gettext", "without-python", "with-python3"]
brew "wakeonlan"
brew "watch"
# Install wget with IRI support
brew "wget", args: ["enable-iri"]
brew "xctool"

# Install special dev related tools
# brew "erlang"
# brew "elixir"
brew "memcached"
# brew ossp-uuid
# brew redis
# brew riak

cask "alfred"
cask "caffeine"
cask "dash"
cask "docker"
cask "dterm"
cask "firefoxdeveloperedition"
cask "gpgtools"
cask "hammerspoon"
cask "java"
cask "p4merge"
cask "seil"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"

mas "Quiver"

