# Usage:
#   brew tap Homebrew/bundle
#   brew bundle

# Install more recent versions of some OS X tools
tap "homebrew/dupes"
# brew homebrew/dupes/rsync

# Install dependencies
brew "automake"
brew "autoconf"
brew "makedepend"
brew "pkg-config"
brew "openssl@1.1"
brew "readline"
brew "coreutils"
brew "findutils" #, args: ["with-default-names"]

# Install Libraries other bottles may depend on
brew "icu4c"
brew "jpeg"
brew "libgcrypt"
brew "libidn"
brew "libpng"
brew "libtiff"
brew "libssh2"
brew "libtool"
brew "libuv" # for powerline
brew "libxslt"
brew "libyaml"
brew "memcached"
brew "gnupg"
brew "boost"
brew "ossp-uuid"
brew "unixodbc"
brew "zeromq"

# Install tools other tools depend on
brew "curl"
brew "unzip"

cask "xquartz"

# Install languages other bottles may depend on
brew "node", args: ["without-npm"]
brew "python@2"
brew "python"
brew "asdf"
