brew "xctool"

# Install casks
cask "1password"
cask "alfred"
cask "blender"
cask "caffeine"
cask "charles"
cask "chromedriver"
cask "colloquy"
cask "dash"
cask "docker"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "google-chrome"
cask "gpg-suite"
cask "hammerspoon"
cask "iterm2"
cask "java"
cask "owncloud"
cask "quickhue"
cask "sourcetree"
# cask "vagrant"
# cask "screenflick"
# cask "virtualbox"
# cask "virtualbox-extension-pack"
cask "caskroom/drivers/synology-cloud-station-drive"
cask "visual-studio-code"

mas "Flycut", id: 442160987
mas "Keynote", id: 409183694
mas "Quiver", id: 866773894
mas "The Unarchiver", id: 425424353
