# Install more tools
brew "ack"
brew "bash-completion"
# brew "cask-repair"
brew "ctags"
# brew "curl"
brew "fontconfig"
brew "webp"       # used by gd
brew "freetype"   # used by gd
brew "git"
brew "hub"
brew "gist"
brew "gd"
brew "mas"
brew "lua51"

brew tap icalialabs/formulae
brew install plis

brew "fswatch"
brew "gpg-agent"
brew "graphviz"
brew "htop"
brew "imagemagick"
brew "mongodb"
brew "mscgen"
brew "mysql"
brew "nvm"
brew "node", args: ["without-npm"]
brew "casperjs"
brew "chromedriver"
brew "phantomjs"
brew "pow"
brew "pstree"
brew "reattach-to-user-namespace"
brew "ssh-copy-id"
brew "tmux"
brew "vim", args: ["with-gettext", "with-python@2"]
brew "wakeonlan"
brew "watch"
brew "wget", args: ["enable-iri"]

mas "Xcode", id: 497799835
