brew "xctool"

# Install casks

## System
cask "gpg-suite"
cask "alfred"
cask "caffeine"
cask "hammerspoon"
cask "iterm2"
cask "java"
cask "owncloud"
cask "caskroom/drivers/synology-cloud-station-drive"
cask "vmware-fusion"

## Browsing
cask "firefoxdeveloperedition"
cask "google-chrome"
cask "chromedriver"

## Graphics and Fotos
cask "adobe-dng-converter"
cask "blender"
cask "lrtimelaps"
cask "freecad"

## Security Tools
cask "1password"
cask "burp-suite"
cask "charles"
cask "colloquy"
cask "malwarebytes"
cask "synalyze-it-pro"
# cask "wireshark"
cask "owasp-zap"

## Electronics Tools
cask "arduino"
cask "eagle"
cask "fritzing"
# cask "ftdi-
cask "silicon-labs-vcp-driver"
cask "wch-ch34x-usb-serial-driver"
cask "raspberry-pi-imager"

## Development Tools
cask "dash"
cask "docker"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "postman"
cask "sequel-pro"
cask "sourcetree"
cask "visual-studio-code"
cask "pgadmin4"
cask "postgrespreferencepane"
# cask "sqlitebrowser"
# cask "mysqlworkbench"

## Productivity
cask "notion"
cask "xmind-zen"
# cask "vagrant"
# cask "screenflick"
# cask "virtualbox"
# cask "virtualbox-extension-pack"

## Music
cask "kid3"
cask "xld"

## Gaming
cask "openemu-experimental"
cask "virtualc64"
cask "wjoy"
cask "discord"

## Other Tools
cask "quickhue"
cask "sweet-home3d"

mas "Flycut", id: 442160987
mas "Keynote", id: 409183694
mas "Quiver", id: 866773894
mas "The Unarchiver", id: 425424353
