# Usage:
#   brew tap Homebrew/bundle
#   brew bundle

# Install GNU utilities (without prefixes)
# Those that come with OS X are outdated
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "coreutils"
brew "findutils" #, args: ["with-default-names"]

# Install more recent versions of some OS X tools
tap "homebrew/dupes"
# brew homebrew/dupes/rsync

# Install dependencies
brew "automake"
brew "makedepend"
brew "pkg-config"
brew "openssl"
brew "readline"

# Install Libraries other bottles may depend on
brew "icu4c"
brew "jpeg"
brew "libgcrypt"
brew "libidn"
brew "libpng"
brew "libtiff"
brew "libssh2"
brew "libtool"
brew "libuv" # for powerline
brew "libyaml"
brew "gnupg"
brew "boost"
brew "ossp-uuid"

cask "xquartz"

# Install languages other bottles may depend on
brew "python"
brew "python3"

